[{"title":"David Cohen","abstract":"David Cohen is the founder and CEO of TechStars. Previously, David was a founder of several software and web technology companies. He was the founder and CTO of Pinpoint Technologies which was acquired by <a href=\"http://www.zoll.com/\">ZOLL Medical Corporation</a> (NASDAQ: <a href=\"http://quotes.nasdaq.com/asp/summaryquote.asp?symbol=ZOLL%60&amp;selected=ZOLL%60\">ZOLL</a>) in 1999. You can read about it in <a href=\"http://www.amazon.com/gp/product/1420819917/sr=8-1/qid=1141840409/ref=sr_1_1/103-1943388-3567068?%5Fencoding=UTF8\">No Vision, All Drive</a> [Amazon]. David was also the founder and CEO of <a href=\"http://www.askdavetaylor.com/keep_track_of_my_favorite_musicians.html\">earFeeder.com</a>, a music service which was sold to <a href=\"http://www.sonicswap.com/\">SonicSwap.com</a> in 2006. He also had what he likes to think of as a \"<a href=\"http://www.davidgcohen.com/2006/11/22/life-in-the-deadpool/\">graceful failure</a>\" in between. \r\n\r\nDavid is a active startup advocate, advisor, board member, and technology advisor who comments on these topics on his blog at <a href=\"http://www.davidgcohen.com/\">DavidGCohen.com</a>. He recently co-authored <a href=\"http://domorefasterbook.com/\"><em>Do More Faster</em></a> with Brad Feld.  He is also very active at the <a href=\"http://www.colorado.edu/\">University of Colorado</a>, serving as a member of the Board of Advisors of the <a href=\"http://www.cs.colorado.edu/\">Computer Science Department</a>, the <a href=\"http://www.silicon-flatirons.org/people.php?id=EntrepreneurialBoardMember\">Entrepreneurial Advisory Board at Silicon Flatirons</a>, and the Board of Advisors of the <a href=\"http://leeds.colorado.edu/Deming/interior.aspx?id=548\">Deming Center</a> Venture Fund. He is a member of the selection committee for <a href=\"http://www.vcintherockies.com/\">Venture Capital in the Rockies</a>, and runs the Colorado chapter of the <a href=\"http://www.openangelforum.com/\">Open Angel Forum</a>. His hobbies are technology, software/web startups, business history, and tennis. He is married to the <a href=\"http://www.jilato.com/\">coolest girl</a> he's ever met and has three amazing kids who always seem to be teaching him something new.\r\n","name":"David Cohen","bio":"David Cohen is the founder and CEO of TechStars. Previously, David was a founder of several software and web technology companies. He was the founder and CTO of Pinpoint Technologies which was acquired by <a href=\"http://www.zoll.com/\">ZOLL Medical Corporation</a> (NASDAQ: <a href=\"http://quotes.nasdaq.com/asp/summaryquote.asp?symbol=ZOLL%60&amp;selected=ZOLL%60\">ZOLL</a>) in 1999. You can read about it in <a href=\"http://www.amazon.com/gp/product/1420819917/sr=8-1/qid=1141840409/ref=sr_1_1/103-1943388-3567068?%5Fencoding=UTF8\">No Vision, All Drive</a> [Amazon]. David was also the founder and CEO of <a href=\"http://www.askdavetaylor.com/keep_track_of_my_favorite_musicians.html\">earFeeder.com</a>, a music service which was sold to <a href=\"http://www.sonicswap.com/\">SonicSwap.com</a> in 2006. He also had what he likes to think of as a \"<a href=\"http://www.davidgcohen.com/2006/11/22/life-in-the-deadpool/\">graceful failure</a>\" in between. \r\n\r\nDavid is a active startup advocate, advisor, board member, and technology advisor who comments on these topics on his blog at <a href=\"http://www.davidgcohen.com/\">DavidGCohen.com</a>. He recently co-authored <a href=\"http://domorefasterbook.com/\"><em>Do More Faster</em></a> with Brad Feld.  He is also very active at the <a href=\"http://www.colorado.edu/\">University of Colorado</a>, serving as a member of the Board of Advisors of the <a href=\"http://www.cs.colorado.edu/\">Computer Science Department</a>, the <a href=\"http://www.silicon-flatirons.org/people.php?id=EntrepreneurialBoardMember\">Entrepreneurial Advisory Board at Silicon Flatirons</a>, and the Board of Advisors of the <a href=\"http://leeds.colorado.edu/Deming/interior.aspx?id=548\">Deming Center</a> Venture Fund. He is a member of the selection committee for <a href=\"http://www.vcintherockies.com/\">Venture Capital in the Rockies</a>, and runs the Colorado chapter of the <a href=\"http://www.openangelforum.com/\">Open Angel Forum</a>. His hobbies are technology, software/web startups, business history, and tennis. He is married to the <a href=\"http://www.jilato.com/\">coolest girl</a> he's ever met and has three amazing kids who always seem to be teaching him something new.\r\n","starts_at":"2012-04-24T19:00:00Z","ends_at":"2012-04-24T20:00:00Z","category":"keynote","room":"Salon HJK"},{"title":"David Heinemeier Hansson","abstract":"David Heinemeier Hansson is a partner at <a href=\"http://37signals.com/\">37signals</a>, a privately-held Chicago-based company committed to building the best web-based tools possible with the least number of features necessary.\r\n\r\n37signals' products include Basecamp, Highrise, Backpack, Campfire, Ta-da List, and Writeboard. 37signals' products do less than the competition -- intentionally.\r\n\r\nHe is also the creator of Ruby on Rails.\r\n","name":"David Heinemeier Hansson","bio":"David Heinemeier Hansson is a partner at <a href=\"http://37signals.com/\">37signals</a>, a privately-held Chicago-based company committed to building the best web-based tools possible with the least number of features necessary.\r\n\r\n37signals' products include Basecamp, Highrise, Backpack, Campfire, Ta-da List, and Writeboard. 37signals' products do less than the competition -- intentionally.\r\n\r\nHe is also the creator of Ruby on Rails.\r\n","starts_at":"2012-04-23T09:15:00Z","ends_at":"2012-04-23T10:00:00Z","category":"keynote","room":"Salon HJK"},{"title":"Rich Hickey","abstract":"Rich Hickey, the author of <a href=\"http://clojure.org/\">Clojure</a> and designer of <a href=\"http://datomic.com/\">Datomic</a>, is a software developer with over 20 years of experience in various domains. Rich has worked on scheduling systems, broadcast automation, audio analysis and fingerprinting, database design, yield management, exit poll systems, and machine listening, in a variety of languages.\r\n","name":"Rich Hickey","bio":"Rich Hickey, the author of <a href=\"http://clojure.org/\">Clojure</a> and designer of <a href=\"http://datomic.com/\">Datomic</a>, is a software developer with over 20 years of experience in various domains. Rich has worked on scheduling systems, broadcast automation, audio analysis and fingerprinting, database design, yield management, exit poll systems, and machine listening, in a variety of languages.\r\n","starts_at":"2012-04-23T17:30:00Z","ends_at":"2012-04-23T18:00:00Z","category":"keynote","room":"Salon HJK"},{"title":"Aaron Patterson","abstract":"When he isn't ruining people's lives by writing software like phuby, enterprise, and neversaydie, Aaron can be found writing slightly more useful software like nokogiri. To keep up his Gameboy Lifestyle, Aaron spends his weekdays writing high quality software for ATTi. Be sure to catch him on Karaoke night, where you can watch him sing his favorite smooth rock hits of the 70's and early 80's.\r\n","name":"Aaron Patterson","bio":"When he isn't ruining people's lives by writing software like phuby, enterprise, and neversaydie, Aaron can be found writing slightly more useful software like nokogiri. To keep up his Gameboy Lifestyle, Aaron spends his weekdays writing high quality software for ATTi. Be sure to catch him on Karaoke night, where you can watch him sing his favorite smooth rock hits of the 70's and early 80's.\r\n","starts_at":"2012-04-24T09:00:00Z","ends_at":"2012-04-24T09:30:00Z","category":"keynote","room":"Salon HJK"},{"title":"Stack Smashing","abstract":"\"Stack Smashing\" refers to an internal project where I took our production Rails application environment down from over 100 virtual machines to 2 physical machines. Our application environment for Major League Gaming consists of 13+ inter-connected applications with millions of users to provide functionality such as single-sign on, online video (both video on demand and UGC), news and live competition information, photo galleries, profiles, and much more. We simply needed a simpler infrastructure in which to develop and deploy our applications. In this talk, we will cover the following:\r\n\r\n  * Network topology before and after, as well as the makeup of our virtual and physical machines.\r\n  * Detailed discussion of Chef recipes, NGINX, HAProxy configurations and updates to standard configurations.\r\n  * Application and service monitoring and configuration.\r\n  * Application migration from the old stack to the new stack.\r\n  * Rails 3 to Rails 3.1 upgrade insights.\r\n  * Unicorns!\r\n  * Strategies for service configuration to handle failure.\r\n  * Offline processing with queueing and queue management.\r\n  * Simplifying, standardizing and sexy-fying your Capistrano-based deployment tasks into a reusable gem.\r\n  * Behavior driven infrastructure monitoring and validation.\r\n  * Adopting an opt-in continuous deployment strategy that is integrated with our continuous integration environment.\r\n\r\nThis will be a very code and example-focused talk. Come and learn about the ways that you can simplify your existing infrastructure.","name":"David Czarnecki","bio":"David Czarnecki is a lead engineer at  Agora Games (a part of Major League Gaming), http://www.agoragames.com, a company that specializes in building middleware to power video games, both in-game and on the web. He is the author of 2 books for O'Reilly and had previously been developing exclusively in Java for nearly 15 years. He has been developing in Ruby and Rails since joining Agora Games in 2008 and has been a speaker at conferences like JavaOne, RailsConf and Ruby Midwest. David loves video games, especially the Guitar Hero series and Left 4 Dead.","starts_at":"2012-04-24T16:00:00Z","ends_at":"2012-04-24T16:45:00Z","category":"standard","room":"Salon H"},{"title":"Ten Things You Didn't Know Rails Could Do","abstract":"Rails is huge.  Even if you have worked with it for a long time, it's unlikely that you have stumbled across everything yet.\r\n\r\nDo you really know what all of the built-in Rake tasks do?  Have you seen all of the methods ActiveSupport makes available to you?  Are you aware of all the queries ActiveRecord is capable of?\r\n\r\nIn this talk, I'll dig into the extras of Rails and see if I can't turn up some features that you don't see all of the time, but that might just be handy to know about anyway.  I'll make sure you come out of this able to impress your friends at the hackfest.\r\n","name":"James Edward Gray II","bio":"James (@JEG2) has been a Rails programmer for about as long as it has been fashionable to be one and a Rubyist even longer than that.  As you probably know from listening to him on the Ruby Rogues podcast, James loves to dig into how our community and code works.","starts_at":"2012-04-24T13:30:00Z","ends_at":"2012-04-24T14:15:00Z","category":"standard","room":"Salon H"},{"title":"Rails Engines Patterns","abstract":"This talk covers a successful utilization of Rails Engines to share features that cut across the layers of MVC in different Rails 3 projects. Rails Engines thus provide the best of both worlds: improved productivity by reusing MVC code (including assets like Javascript, CSS, and Images) and better flexibility by allowing different applications to customize behavior as needed without reliance on application-dependent conditionals. Rails Engine patterns will be provided to guide developers on how to leverage Rails Engines' reusability and flexibility without sacrificing maintainability.\r\n\r\nOutline:\r\n\r\n- Basics of Rails Engines\r\n- Rails Engine Patterns\r\n- Improved Productivity Tips\r\n- Summary of Benefits and Trade-Offs\r\n\r\nAttendees should walk away with an overview of Rails Engines and guidelines on how to utilize them effectively.","name":"Andy Maleh","bio":"Andy Maleh is a Software Engineer at Groupon who specializes in user needs analysis and building transformative software that meets ongoing demands. He leads by embracing agile practices and software craftsmanship in the process of perfecting Groupon's deal experience. He joined Groupon via Obtiva, where he served as a Senior Consultant for more than five years. Andy is also the Founder and Lead Developer of the Glimmer open source project for Desktop Development with Ruby.\r\n\r\nAndy holds an M.S. in Software Engineering from DePaul University in Chicago and a B.S. in Computer Science from McGill University (Montreal). Outside of Groupon walls, Andy is a drummer in two indie rock bands (Gag Order and Cletus Darby) and travels via Longboard when the Chicago weather permits.","starts_at":"2012-04-23T13:30:00Z","ends_at":"2012-04-23T14:15:00Z","category":"standard","room":"Salon J"},{"title":"Mobile Rage - What causes it & how to fix it","abstract":"Most of us have been there.  That website you want to use, from your mobile device, that just refuses to cooperate.  From the Flash-only, to the can't f**king log in, to the redirect-to-mobile-and-stay-there sites, there's more than enough websites out there to invoke Mobile Rage.\r\n\r\nAlthough we all know that the best mobile development strategy is \"mobile-first\", we also all know how many sites and applications out there were designed and built by people who didn't imagine how fast mobile would take over.\r\n\r\nCome learn about the common mistakes most people make for mobile, and some of the simple solutions you can use to help reduce Mobile Rage, without having to do a complete rewrite.","name":"Lori M Olson","bio":"Six years ago Lori tried Ruby/Rails as an alternative to Java development and \"has never looked back!\" She has been delivering Rails and Javascript based applications in the oil & gas industry for the last six years, working for companies like Labrador Technologies, CodeGear/Borland, and Intellog.\r\n\r\nLori has a long list of speaking credits. Most recently, she spoke at Confoo 2012 in Montreal, jQuery Conf Boston 2011, Madison Ruby 2011, and Conferencia Rails 2010 in Madrid. She has also presented at the CodeRage and COSSFEST conferences, and has presented frequently to the Calgary Ruby User Society, of which she is also a co-founder","starts_at":"2012-04-23T13:30:00Z","ends_at":"2012-04-23T14:15:00Z","category":"standard","room":"Salon H"},{"title":"Taming the Kraken - How Operations enables developer productivity","abstract":"Are you having trouble launching new features because of friction between development and operations?  At CustomInk, we've reduced this friction by making changes to our teams, processes, and tools.  Come find out what we've been up to and learn how you can implement similar changes in your own environment.\r\n\r\nThere's always a bit of tension when getting features from idea to production.  In this talk, we'll look at some of the changes CustomInk has made to reduce this friction and keep the new features coming.  Gone are the days of bi-monthly deploys, office pools dedicated to guessing when this deploy will be rolled back, and the ceremony surrounding the deploy-rollback-fix-deploy cycle.  Today, ideas flow from product managers to developers to production with ease thanks to a number of changes that we've made to our teams, processes and tools.\r\n\r\nDuring this talk, we'll look at:\r\n\r\n* How product managers drive the release cycle\r\n  * Ideas and customer feedback\r\n  * Prioritizing development requests\r\n  * Managing branch merges and deployments (yes, product managers can help here!)\r\n\r\n* How operations enables developer productivity\r\n  * Spinning up development environments - Vagrant, Chef\r\n  * Infrastructure Automation - Chef\r\n  * Enabling Continuous Deployment - Capistrano and caphub\r\n  * Failing gracefully - Fault-tolerant load balancing with ldirectord\r\n\r\n* How developers get their code running in production\r\n  * Staging environments\r\n  * Continuous Integration - Jenkins, Green Screen\r\n  * Staying on topic:  Deploying changes when they're ready\r\n  \r\n* Getting rid of the over-the-wall mentality - Dev & Ops working together\r\n  * Enabling developers to do it themselves\r\n  * Pair programing infrastructure automation\r\n  * Keeping the process light and the communication flowing","name":"Nathen Harvey","bio":"Nathen Harvey is the manager of Web Operations for CustomInk.com, a website that allows you to design and purchase custom apparel for your group or special event. Nathen is the co-organizer of the Washington DC MongoDB Users' Group and DevOps DC. Nathen contributes to open source projects including the Opscode Chef framework.  When not working or hosting meetups, Nathen enjoys going to concerts, drinking craft beer, and over sharing on sites like twitter, untappd, and foursquare.","starts_at":"2012-04-24T10:30:00Z","ends_at":"2012-04-24T11:15:00Z","category":"standard","room":"Salon H"},{"title":"RoRoRoomba - Ruby on Rails on Roomba","abstract":"RoR makes an excellent framework for off-the-beaten-path type of projects, like hacking Roombas and other robots. In this presentation, I'll demonstrate how our soon to be robot overlords will be happy when we gift them with RoR and a connection to the internet. The presentation will include working examples and demonstrations of:\r\n\r\n- communicating with an Arduino chip via Ruby\r\n- tethered serial and wireless bluetooth control of a Roomba via Ruby and Arduino\r\n- two-way communication with our robot friends over the web using Ruby on Rails and popular web services\r\n- useful applications of robots controlled over the web\r\n- 3 RoRoR pitfalls to watch-out for\r\n- live performance of \"Chiron Beta Prime\" by Jonathan Coulton*\r\n\r\nThe presentation will close with an argument for why hacking on fun, often eccentric, projects in your spare time is essential for staying motivated, habitual improvement, and tangential learning -- i.e., being a real pragmatic programmer.\r\n\r\n*not included, perhaps","name":"Charles Abbot","bio":"Charles works at COOKPAD, Japan's largest recipe site and Rails shop. He spends most of his daylight hours building reporting, analytic, and payment management systems that millions of loyal users don't actually get to see. When he's not at work graphing bell-curves, forecasting user behavior, and throwing around gut-wrenching terms like \"correlation-coefficients\" and \"confidence intervals\"  - he likes to play basketball, prepare his Roomba for the robot uprising, and dote on his newborn daughter. Charles has been using Ruby and Rails since Feb of '06.","starts_at":"2012-04-23T13:30:00Z","ends_at":"2012-04-23T14:15:00Z","category":"standard","room":"Salon K"},{"title":"Progressive Enhancement on the Mobile Web","abstract":"Progressive Enhancement isn't important on the mobile web because it's all Webkit right? Not so fast. Even among Webkit implementations events, css, and performance vary widely. We'll talk about the darker corners of the mobile web and show how jQuery Mobile can help you build Rails applications that are reliable, accessible, and support more devices.","name":"John Bender","bio":"John Bender is the co-creator of Vagrant, a jQuery Mobile contributor, and a recovering polygot. During the day he works full-time on jQuery Mobile at Adobe and otherwise spends his time hacking on open source. John shares his thoughts at http://johnbender.us and as @johnbender on Twitter.","starts_at":"2012-04-23T14:30:00Z","ends_at":"2012-04-23T15:15:00Z","category":"standard","room":"Salon H"},{"title":"From Rails Rumble to 50,000,000 results","abstract":"StillAlive.com was born from the 48 hour intense 2010 Rails Rumble and has grown!  Having recently passed our 50,000,000th site result, this talk discusses the real world challenges and optimisations required to take a code base born from the fires of YAGNI to a production system.\r\n\r\nThis talk isn't about how you can scale from 0 requests to 500 billion requests per microsecond, but give a practical view to some of the performance problems we faced as the application steadily grew from a hack job into a functioning system.\r\n\r\nThe journey will go through the mistakes we made, challenges faced and real world optimisations discovered, including some tricks we learnt along the way from concurrent index creation to using the ZeroMQ messaging framework with Rails","name":"Mikel Lindsaar","bio":"Mikel Lindsaar heads up reInteractive, a Rails development company in Sydney Australia and StillAlive.com a web application monitoring service, he is also the author of the Ruby mail gem, is on the Rails commit team for his work on ActionMailer and has contributed to many open source projects.\r\n","starts_at":"2012-04-23T14:30:00Z","ends_at":"2012-04-23T15:15:00Z","category":"standard","room":"Salon J"},{"title":"Rails: The Next Five Years","abstract":"When Ruby on Rails burst onto the scene in 2004, it excited web developers by showing that you could build next generation apps quickly and efficiently. Rails was one of the first frameworks to embrace Ajax, giving everyone the power to do partial page updates and whiz-bang effects in a conventional, effortless way.\r\n\r\nIn 2007, the Rails team embraced RESTful conventions, making API development a no-brainer for new applications. Because RESTful JSON is so easy in Rails, Rails applications tend to implement APIs on balance.\r\n\r\nThen it was time to polish. Both the 2.0 and 3.0 releases cleaned up the code-base and found ways to take emerging conventions and make them easier to use.\r\n\r\nBut now, like in 2004, another revolution is brewing. Increasingly, developers are moving their view layer from the server into the client, using RESTful JSON and client-side templating to increase responsiveness and bring applicable aspects of desktop applications to the web.\r\n\r\nLike last time, not every application needs to jump head-first into this new world. But just as in 2004, Rails has an opportunity to embrace the future, and bring its ruthless insistence on convention over configuration to bear on this problem.\r\n\r\nRails already has the plumbing to be a fantastic conventional JSON server. The question is: will we take the challenge, or will we desperately cling to the past, hoping that the future will never come?","name":"Yehuda Katz","bio":"Yehuda Katz is a member of the Ember.js, Ruby on Rails and jQuery Core Teams; he spends his daytime hours at the startup he founded, Tilde Inc.. Yehuda is the co-author of the best-selling jQuery in Action, Rails 3 in Action, and is a contributor to Ruby in Practice. He spends most of his time hacking on open source--his main projects, along with others, like Thor, Handlebars and Janus--or traveling the world doing evangelism work. He blogs at http://yehudakatz.com and can be found on Twitter as @wycats.","starts_at":"2012-04-25T10:30:00Z","ends_at":"2012-04-25T11:15:00Z","category":"standard","room":"Salon J"},{"title":"Practical Machine Learning and Rails","abstract":"Many people know that machine learning techniques can facilitate learning from, and adapting to, noisy, real-world data, but aren't sure how to begin using them.   Starting with two real-world examples, we will introduce you to some libraries that bring machine learning techniques to your Rails applications.   We will then dive into the art of feature design, one of the first practical roadblocks that many people encounter when applying machine learning.  Feature design is the challenging, subtle, and often trail-and-error process of selecting and transforming the data you provide for your learning algorithm, and it is often the hardest part of using these techniques.  Our goal is for you to come out of this talk with the tools necessary to think about machine learning and how to apply it to your problems.","name":"Andrew Cantino & Ryan Stout","bio":"Andrew Cantino has been building web applications for over fifteen years.  Andrew has a Masters in Computer Science from Georgia Tech, where he focused on machine learning and artificial intelligence.  He has worked on Gmail at Google, on video search at CastTV, and recently spent two years practicing Agile software development at Pivotal Labs.  Andrew is currently VP of Engineering at Mavenlink.\r\n\r\nRyan Stout has also been doing web development for fifteen years and has been working with Rails for the last six.  He runs a small web-consulting agency and has been involved in startups ranging from social gaming to online dating and domain search.  He spent the last year developing a stealth startup that uses both natural language processing systems and modern machine learning techniques.","starts_at":"2012-04-23T11:30:00Z","ends_at":"2012-04-23T12:15:00Z","category":"standard","room":"Salon K"},{"title":"Securing your site","abstract":"Rails makes it very easy to rapidly develop web applications, but doesn’t always make it so simple to deploy or secure them. \r\n\r\nThis talk is going to focus on best practices to secure your rails application, learnt through multiple high profile projects and penetration tests. The talk will be practical and show that this isn’t necessarily hard if thought about from the start. \r\n\r\nWe’ll also touch on getting the right balance of security without it getting in the way of the users.","name":"Thomas Pomfret","bio":"Thomas is CTO at Mint Digital where he has worked since the very beginning after acing the interview almost purely on the back of a sharp suit. Having been involved in all of Mint's major projects he has great real world experience in developing mass participation web sites quickly and effectively along with some hard lessons learnt on how to make them stay up. He mainly hacks in ruby although has a growing love for erlang.\r\n\r\nPast speaking gigs include Scotland on Rails, London Ruby Users Group and Kings of Code.","starts_at":"2012-04-23T16:00:00Z","ends_at":"2012-04-23T16:45:00Z","category":"standard","room":"Salon J"},{"title":"Complex Made Simple: Sleep Better with TorqueBox","abstract":"Even the simplest of Rails applications can eventually grow into a twisted mess of complexity. At some point you will need a background task, or a long-running service, or a scheduled job, or all of the above and more. All of these little bits of functionality added to an application ad hoc can keep you up at night with cold sweats and nightmares. But it doesn't have to be that way.\r\n\r\nIn this presentation, we will examine a complex Rails application - complexity that is eventually common to most modern Rails apps: background tasks, scheduled jobs, WebSockets, long-running services, caching and more. We will look at the challenges inherent in these features for both development and deployment. Then we'll look to TorqueBox for simple solutions to these complex problems. You'll never have that long-runing service using the wrong Ruby code again; no more environment variable nightmares in your cron jobs. You can sleep better now.\r\n\r\nTorqueBox is a Ruby application server that is built on JRuby and JBoss AS7. It provides asynchronous messaging, scheduled jobs, long-running processes, caching, simple deployment, and much more. TorqueBox is designed to bring the power, scalability and stability of these time-tested JavaEE services to Ruby applications through a simple and expressive Ruby interface.","name":"Lance Ball","bio":"Lance Ball is a Senior Software Developer at Red Hat and a core member of the TorqueBox team. He has been writing code for over a dozen years in startups, as a consultant, and working for The Man. His ideas have been expressed in Ruby, Java, Perl and C++. As a consultant, Lance wrote Rails and Sinatra applications before joining Red Hat. He's on Twitter as @lanceball. ","starts_at":"2012-04-25T13:30:00Z","ends_at":"2012-04-25T14:15:00Z","category":"standard","room":"Salon H"},{"title":"Realtime web applications with streaming REST","abstract":"As more people collaborate on the web with your applications, its not enough to just persist data to the database; it needs to be pushed out to your users web browsers so that they're always working with the freshest data.\r\n\r\nIn this session, Brad will show how to build a real-time layer on top of an existing Rails application's authorization and resource logic so that you can build on top of the hard work already invested in your Rails application.\r\n\r\nTopics that will be discussed include:\r\n\r\n- Why I didn't choose Socket.IO\r\n- Stream application resources into Backbone.js models to keep data fresh\r\n- Hook into ActiveRecord to push representations of data into a message queue\r\n- Message queue naming conventions public/private resource streams\r\n- Exposing message queues to HTTP\r\n- Securing streams with existing application authorization logic\r\n- Considerations for streaming in a production environment","name":"Brad Gessler","bio":"I'm the CTO at Poll Everywhere, the worlds largest mobile survey platform, and I love building stuff. I've been hacking Rails since 1.x, full embraced REST, and haves since extended the concept to make building realtime Rails application easier.","starts_at":"2012-04-23T16:00:00Z","ends_at":"2012-04-23T16:45:00Z","category":"standard","room":"Salon K"},{"title":"Getting Down To Earth: Geospatial Analysis With Rails","abstract":"It is no secret that location has become ubiquitous. Mobile GPS, available data sets, and easy-to-use mapping services have brought geospatial information within reach of web developers. Location already plays a significant role in many of the major services such as Twitter, Facebook, and Google, not to mention legions of startups.\r\n\r\nHowever, for those of us implementing more than the most trivial features, it is also true that location is challenging. A significant learning curve awaits us, involving spatial databases, coordinate systems, interchange formats, and plenty of math. Our Ruby-based tools lag a bit behind those available to our Java- and Python-oriented colleagues, and effective documentation is scarce.\r\n\r\nThis presentation aims to jump-start Rails developers hoping to go beyond putting a few pushpins on a Google Map. Rather than spending a lot of time explaining the many concepts involved, we'll bypass the learning curve and jump straight into walking through code for a few nontrivial applications. The hope is that the conceptual knowledge will come naturally as a result of seeing it in action, but pointers to online resources will also be provided to fill in any gaps.\r\n\r\nA thorough understanding of Ruby, Rails, ActiveRecord, and SQL will be assumed. No prior knowledge of GIS or computational geometry will be required, though it may be helpful.\r\n","name":"Daniel Azuma","bio":"Daniel Azuma is a Ruby developer specializing in geospatial technologies, computational geometry, graphics, and related fields. He is the author of RGeo and related gems commonly used for geospatial analysis in Ruby and Rails applications. He currently works as Chief Software Architect at Pirq, and blogs at daniel-azuma.com.\r\n","starts_at":"2012-04-23T11:30:00Z","ends_at":"2012-04-23T12:15:00Z","category":"standard","room":"Salon H"},{"title":"What a long Strange Trip it has been.","abstract":"This talk will explore the story of Ezra's travels through the history of ancient Rails 0.6 when he first picked it up in 2004 all the way through current times and extrapolate out to the future of the Rails and Ruby platform and how much of a success it has been. We will talk about the twisting path from way back then to now and beyond and explore what Rails was, is and will be as time keeps on slipping into the future.\r\n\r\nThis talk will be chock full of aqdvancxed tech as well as ramblings of a Rails industry Vet who has been \"On the Rails\" for *8* long years now and has played a major part in shaping what has been, is and will be(at least in his own mind where he is absolutely a legend, in reality he's just a schmuck who hacks ruby)\r\n\r\nI want to share with the Rails community my story and experiences and hopefully impart some wisdom and some hard learned lessons about life, liberty and the pursuit of a rails app that doesn't use 400Mb of RAM per process ;)","name":"Ezra Zygmuntowicz","bio":"Ezra Zygmuntowicz is one of the early pioneers in the rails space. He was one of three original founders of Engine Yard and spearheaded much of the open source culture and community support for ruby in general that the company was built on. He is the author of Deploying Rails Applications for there pragmatic programmers and released one of the earliest commercial websites written in Rails back in fall of 2004 for the Yakima Herald Republic Newspaper.\r\n\r\nEzra is the \"deployment guy\", when you look back in history on the rails mailing list you will find literally thousands of posts about deployment and helping the community figure out how to deploy and scale rails apps when no one knew how to do it.\r\n\r\nEzra has build multiple clouds from the ground up. One IaaS cloud for Engine Yard before there was the term cloud at all, before EC2 existed even. He also built 2 PaaS clouds, Appcloud, Engine Yard's current AWS PaaS platform and Cloud Foundry a VMWare project. I think it may be safe to say that he has deployed more rails apps personally then anyone else on the planet.\r\n\r\nEzra is a speaker at many ruby and cloud related technology conferences and has spoken at every single railsconf since the first one but missed out on speaking at the last 2 events.\r\n\r\nEzra has become a Extroverted Mad Scientist Recluse with entrepreneurial tendencies and more recently has gone back to his roots in the physical world building many embedded electronics projects, blowing glass artwork, building and using multiple 3d printers, CNC machines and Laser cutters and recently even built his own CO2 laser from scratch!.\r\n\r\nHe has come full circle from artists to technologist and back again, this time applying the technology of rails, ruby,cloud and the internet to classic artwork in mediums like Glass, QWood, Metals and Plastics. He is now slowly building the Internet of Things.","starts_at":"2012-04-25T11:30:00Z","ends_at":"2012-04-25T12:15:00Z","category":"standard","room":"Salon K"},{"title":"Semi Automatic Code Review","abstract":"Rails is so popular to be used to fast build a website, at the beginning we sometimes write codes too fast without considering code quality, but after your company grows fast, you have to pay more attentions on code review to make your website more robust and more maintainable.\r\n\r\nIn this talk I will introduce you a way to build a semi automatic code review process, in this process a tool will analyze the source codes of your rails project, then give you some suggestions to refactor your codes according to  rails best practices. It can also check your codes according to your team's rails code guideline. So engineers can focus on implementation performance, scalability, etc. when they do code review.","name":"Richard Huang","bio":"Richard Huang is a senior engineer, a passionate rubyist and open source advocate, he created  <a href=\"https://github.com/railsbp/rails_best_practices\">rails_best_practices</a> gem, and also built the websites <a href=\"http://rails-bestpractices.com\">rails-bestpractices.com</a> and <a href=\"http://railsbp.com\">railsbp.com</a>","starts_at":"2012-04-24T11:30:00Z","ends_at":"2012-04-24T12:15:00Z","category":"standard","room":"Salon K"},{"title":"Redis Application Patterns in Rails","abstract":"Redis is a darling of the NoSQL crowd and for good reasons. It's easy to setup and has blazing fast performance. In this talk, drawn on real production experience and real code straight out of the DueProps codebase, Obie will introduce and demonstrate key Redis application patterns vital to today's Rails developer. Emphasis will be placed on real-world constraints and how to leverage Redis to improve scaling and performance over plain-vanilla ActiveRecord applications.\r\n\r\nConcepts covered:\r\n* Adding Redis-based flags and other properties to ActiveRecord objects\r\n* Event tracking with Redis sets\r\n* Graphing relationships between (User) objects with Redis sets\r\n* Time-ordered activity feeds with Redis sorted sets\r\n* Applying security restrictions to display of activity feeds with intersection of Redis sorted sets\r\n* Aggregating group activity feeds with union of Redis sorted sets\r\n* Applying Redis sorted sets to scoring and leaderboard programming\r\n* Integrating Redis with Rspec and Cucumber\r\n* Debugging tactics for when things go wrong or are unclear","name":"Obie Fernandez","bio":"Obie Fernandez is an author and entrepreneur. He founded Hashrocket in 2007 and led it to prominence as one of the world’s leading Rails-based design and development shops. He is also a  frequent speaker at industry events and is Addison Wesley’s Series Editor for the bestselling Professional Ruby Series. Prior to Hashrocket, as a senior consultant at ThoughtWorks, Obie specialized in complex custom enterprise software projects. His latest startup is DueProps.com, a promising new web startup that aims to revolutionize the way that people are recognized at work.","starts_at":"2012-04-25T10:30:00Z","ends_at":"2012-04-25T11:15:00Z","category":"standard","room":"Salon K"},{"title":"Presenters and Decorators: A Code Tour","abstract":"Presenter and Decorators are design approaches that can be used in Rails applications outside of the standard Models, Views and Controllers. These approaches are becoming more and more popular as teams search for new ways to identify and manage the complexity within their applications.\r\n\r\nIn this session Mike Moore will defined the Presenter and Decorator approaches using simple and clear terminology. Common design problems in Rails applications will be shown using real-life code examples and refactored toward Presenters and Decorators. Code will be improved and strengthened by identifying and respecting the dependencies within large applications.","name":"Mike Moore","bio":"Mike Moore hacks for a living at Bloomfire. He organizes conferences, is an occasional podcaster, part-time purveyor of Ruby-themed apparel, and tries to be a nice guy. He loves his family and the Ruby community.\r\n\r\nhttp://blowmage.com/\r\nhttp://twitter.com/blowmage\r\nhttp://github.com/blowmage","starts_at":"2012-04-24T10:30:00Z","ends_at":"2012-04-24T11:15:00Z","category":"standard","room":"Salon K"},{"title":"Ruby Rogues Live","abstract":"Ruby's favorite podcast comes to RailsConf! Join the Ruby Rogues (David Brady, James Edward Gray II, Avdi Grimm, Josh Susser, and Charles Max Wood) for this live episode on What Rails Developers Should Care About.\r\n\r\nIf you've listened to the show, you probably know that the Rogues favor:\r\n\r\n* Good Object Oriented design\r\n* Patterns\r\n* Test Driven Development\r\n* The Law of Demeter and Tell, Don't Ask\r\n* Open source\r\n* Beautiful code\r\n* Pair programming\r\n* Code metrics\r\n* Scaling performant code\r\n* and more\r\n\r\nSince this is a live episode, we want to interact with the audience. Each Rogue will give a brief introduction on what's important to him as a Rubyist on Rails, then we will turn the session over to your questions. We will take them over the Internet and/or live, before and during the show.\r\n\r\nAll that AND we promise to wear amazing hats!","name":"Ruby Rogues Live","bio":"Ruby's favorite podcast comes to RailsConf! Join the Ruby Rogues (David Brady, James Edward Gray II, Avdi Grimm, Josh Susser, and Charles Max Wood) for this live episode on What Rails Developers Should Care About.\r\n\r\nIf you've listened to the show, you probably know that the Rogues favor:\r\n\r\n* Good Object Oriented design\r\n* Patterns\r\n* Test Driven Development\r\n* The Law of Demeter and Tell, Don't Ask\r\n* Open source\r\n* Beautiful code\r\n* Pair programming\r\n* Code metrics\r\n* Scaling performant code\r\n* and more\r\n\r\nSince this is a live episode, we want to interact with the audience. Each Rogue will give a brief introduction on what's important to him as a Rubyist on Rails, then we will turn the session over to your questions. We will take them over the Internet and/or live, before and during the show.\r\n\r\nAll that AND we promise to wear amazing hats!","starts_at":"2012-04-25T09:00:00Z","ends_at":"2012-04-25T09:45:00Z","category":"keynote","room":"Salon HJK"},{"title":"How Rails helps make cooking more fun in Japan","abstract":"With more than a million user submitted recipes and an active user base of 15 million monthly unique users, cookpad.com is the world's largest recipe website, and an essential tool for the 50% of all Japanese women in their 20's and 30's who use the site regularly.\r\n\r\nThe Cookpad.com service is built on Rails and is running entirely on AWS in Tokyo, where more than 30 engineers are working in small agile teams to bring more value to users every day.\r\n\r\nAs you know, Japan had a huge earthquake and tsunami last year, and some of those affected didn't have cooking facilities, water or basic foods for long time. Many Cookpad users immediately uploaded simple recipes that could be made without the basics in adverse conditions, and helped those in hardship immensely allowing them to enjoy food with their families at that difficult time.\r\n\r\nIn this session, I'll talk about the COOKPAD way of creating services and the technologies behind them, and how we improve peoples lives through cooking every day.\r\n","name":"Masahiro Ihara","bio":"Masahiro Ihara is Vice President Engineering at Cookpad Inc. in Tokyo.","starts_at":"2012-04-23T14:30:00Z","ends_at":"2012-04-23T15:15:00Z","category":"products","room":"Room 615"},{"title":"Rails for Zombies (AKA Intro to Rails - Part 1)","abstract":"Do you need to start learning Ruby on Rails? In this morning tutorial the Envy Labs team will lead you through all five labs of their Rails for Zombies course. Unlike other tutorials, all you need to start coding Rails is a laptop with Wi-Fi and a browser which isn’t Internet Explorer. All coding will be done through our web application, and there will be plenty of lab assistants to help you if you get stuck along the way. Before you come to the course we recommend you play through http://www.tryruby.org/. It’s an in-browser Ruby tutorial.\r\n\r\nTopics Covered\r\n* Basic ActiveRecord CRUD\r\n* Models, Validations, has_many, belongs_to\r\n* Views, ERB, Loops\r\n* Controllers, before filter\r\n* Basic Routing","name":"Gregg Pollack","bio":".","starts_at":"2012-04-23T10:30:00Z","ends_at":"2012-04-23T14:30:00Z","category":"intro","room":"Room 616"},{"title":"Rails for Zombies 2 (AKA Intro to Rails - Part 2)","abstract":"Done with Rails for Zombies but can't stop the craving for a second corpse? We’ll pickup where Rails for Zombies 1 leaves off and jump into the topics listed below. All you need to bring is a laptop with Wi-Fi and a browser which isn’t Internet Explorer. All coding will be done through our web application, and there will be plenty of lab assistants to help you if you get stuck along the way. \r\n\r\nTopics Covered\r\n* How to create a Rails app, the command line, database migrations, the Ruby 1.9 Hash Syntax, Bundler, and Database configuration.\r\n* Named Scope, Callbacks, Include, has_many, and has_many :through relationships.\r\n* REST principles, view forms, nested resources, and view partials.\r\n* Sending email from our Rails app and the Rails 3.1: the Asset Pipeline.\r\n* Controller rendering options and custom RESTful routes. Design an API with Rails and respond to AJAX requests.","name":"Gregg Pollack","bio":".","starts_at":"2012-04-24T10:30:00Z","ends_at":"2012-04-24T14:30:00Z","category":"intro","room":"Room 616"},{"title":"Rails Testing for Zombies","abstract":"So you’ve got the basics of Rails down, but you haven’t really done any testing.  Never fear, this course will lead you through everything you need to know to start testing your Rails apps.  All you need to bring is a laptop with Wi-Fi and a browser which isn’t Internet Explorer. All coding will be done through our web application, and there will be plenty of lab assistants to help you if you get stuck along the way. \r\n\r\nTopics Covered\r\n* Test Unit basics\r\n* Testing Rails models, using fixtures, and validation testing.\r\n* Improving our testing code with macros, shoulda basics, and setup/teardown.\r\n* Mocking and Stubbing with Mocha\r\n* Testing the whole Rails stack with Capybara Integration tests\r\n* Using Factory Girl to replace Fixtures","name":"Gregg Pollack","bio":".","starts_at":"2012-04-25T10:30:00Z","ends_at":"2012-04-25T14:30:00Z","category":"intro","room":"Room 616"},{"title":"ActiveSupport and ActiveModel","abstract":"Have you ever wondered what makes Rails tick? Bryan Liles will cover two of the pillars of the Rails foundation: ActiveSupport and ActiveModel. Together we will discover where some of Rails’ ease and power originates and how make use of it in your projects.","name":"Bryan Liles","bio":".","starts_at":"2012-04-23T14:30:00Z","ends_at":"2012-04-23T15:00:00Z","category":"intro","room":"Room 616"},{"title":"Rails-flavored Ruby","abstract":"Based on Chapter 4 of the Ruby on Rails Tutorial by Michael Hartl, “Rails-flavored Ruby” covers the aspects of the Ruby programming language most important for developing Rails applications. Topics include hashes, arrays, and other objects; blocks; functions; and classes. ","name":"Michael Hartl","bio":".","starts_at":"2012-04-23T15:00:00Z","ends_at":"2012-04-23T15:30:00Z","category":"intro","room":"Room 616"},{"title":"RVM & Essential Rails Development Tools","abstract":"Working with Rails often means switching between several Ruby versions back and forth which is made almost seamless by RVM. It also involves several simple command line tools like Pry, Guard, and Pow and that will make your development life so much easier.","name":"Olivier Lacan","bio":".","starts_at":"2012-04-23T16:00:00Z","ends_at":"2012-04-23T16:30:00Z","category":"intro","room":"Room 616"},{"title":"ActiveRecord Scopes and Arel","abstract":"Scopes are a great way of encapsulating query logic in a granular, reusable way. This talk will cover some techniques you can use to keep those scopes as composable and portable as possible.  We’ll cover how to use Arel directly, while avoiding the common practice of using SQL fragments, and show you how this can make your scopes more reusable, while at the same time preventing you from using database vendor specific operators, such as ILIKE.","name":"Jacob Swanner","bio":".","starts_at":"2012-04-23T16:30:00Z","ends_at":"2012-04-23T17:00:00Z","category":"intro","room":"Room 616"},{"title":"Basic Rake","abstract":"Anyone who develops with Rails uses the Rake tool all the time. Rake will run your tests, migrate your database, and precompile your assets. But did you know you can define and build your own Rake tasks? This short talk will cover the basics of using Rake and writing simple automation tasks to make your development process smother.","name":"Jim Weirich","bio":".","starts_at":"2012-04-24T14:30:00Z","ends_at":"2012-04-24T15:00:00Z","category":"intro","room":"Room 616"},{"title":"How to Find Valuable Gems","abstract":"There’s no need to reinvent the wheel. There are over 30,000 RubyGems available on just RubyGems.org, alone. But with so many out there, it must be impossible to find the right one, right? In this talk we’ll learn about some resources which help you find the right gems, as well as how to intelligently decide if a library is right for your project.","name":"Nathaniel Bibler","bio":".","starts_at":"2012-04-24T15:00:00Z","ends_at":"2012-04-24T15:30:00Z","category":"intro","room":"Room 616"},{"title":"Securing the Rails","abstract":"Building safe web applications isn’t always easy. The good news is that Rails provides a lot of features that will help you along the way. Aaron will walk you through the common mistakes made by web developers, and how to account for them while working with Rails. He will also walk you through some tools you can use to make securing your applications much much easier.","name":"Aaron Bedra","bio":".","starts_at":"2012-04-24T16:00:00Z","ends_at":"2012-04-24T16:30:00Z","category":"intro","room":"Room 616"},{"title":"Powerful Interfaces","abstract":"In this talk we will explore the best practices in using interfaces as the foundation for designing object oriented applications in Ruby and Rails. We will talk about some of the techniques that make it possible to write loosely coupled components that can be easily extended to respond to requirement changes.","name":"Caike Souza","bio":".","starts_at":"2012-04-24T16:30:00Z","ends_at":"2012-04-24T17:00:00Z","category":"intro","room":"Room 616"},{"title":"Testing Best Practices, or The Five Habits of Highly Effective Tests","abstract":"There’s all kinds of discussion on how to make test processes work, and how to make tests fast, but it sometimes seems like there’s not much discussion on how to make tests useful. What makes a BDD test valuable, in that it will save more time that it will cost in maintenance? I’ll claim that there are five things that you should look for in your tests: independence, repeatability, clarity, conciseness, and robustness. These features will make the tests easier to write, easier to verify, and easier to keep consistent as your application becomes more complicated. You’ll leave this talk ready and able to write great tests.","name":"Noel Rappin","bio":".","starts_at":"2012-04-25T14:30:00Z","ends_at":"2012-04-25T15:00:00Z","category":"intro","room":"Room 616"},{"title":"Introduction to RSpec","abstract":"“A testing tool by any other other name would assert as truthy.” – some guy.  You’ve seen Rails’ built-in Test::Unit in the morning session.  This afternoon, we’ll introduce RSpec, another popular testing tool.  We’ll overview basic structure, contexts, “should” expectations, mocking and stubbing.  We’ll also cover Rails model, view, controller, routing, helper, and request specs.","name":"Jon \"Lark\" Larkowski","bio":".","starts_at":"2012-04-25T15:00:00Z","ends_at":"2012-04-25T15:30:00Z","category":"intro","room":"Room 616"},{"title":"Ruby Hero Awards","abstract":"There are many people in the Ruby/Rails world who contribute to our community and rarely receive any recognition or payment for their work.\r\n\r\nThey create educational content, develop plugins & gems, contribute to open source projects, and even put on events which help educate and make our lives as developers easier.\r\n\r\nRuby Heroes was created to show some gratitude and give these people the recognition they deserve. Hopefully the type of recognition that keeps them doing what they’re doing, and continuing to make our community stronger.","name":"Ruby Hero Awards","bio":"There are many people in the Ruby/Rails world who contribute to our community and rarely receive any recognition or payment for their work.\r\n\r\nThey create educational content, develop plugins & gems, contribute to open source projects, and even put on events which help educate and make our lives as developers easier.\r\n\r\nRuby Heroes was created to show some gratitude and give these people the recognition they deserve. Hopefully the type of recognition that keeps them doing what they’re doing, and continuing to make our community stronger.","starts_at":"2012-04-24T09:30:00Z","ends_at":"2012-04-24T10:00:00Z","category":"keynote","room":"Salon HJK"},{"title":"Welcome","abstract":"Welcome to RailsConf 2012!","name":"Welcome","bio":"Welcome to RailsConf 2012!","starts_at":"2012-04-23T09:00:00Z","ends_at":"2012-04-23T09:15:00Z","category":"keynote","room":"Salon HJK"},{"title":"CoffeeScript for the Rubyist","abstract":"CoffeeScript is taking the world, and particularly the Rails eco system, by storm. This little language has provided an almost Ruby like abstraction onto of JavaScript. CoffeeScript is trying to make writing  front end code as much fun as Ruby makes writing backend code.\r\n\r\nIn this talk we start with the basic concepts of CoffeeScript and move on to the more powerful and fun features of the language. While we're looking at CoffeeScript we'll see how it relates to the Ruby code we write everyday. What do Ruby 1.9 lambdas and CoffeeScript functions have in common? Which of the two languages supports splats, default arguments, and ranges? The answers may surprise you.","name":"Mark Bates","bio":"Mark Bates is the founder and chief architect of the Boston, MA based consulting company, Meta42 Labs. Mark spends his days focusing on new application development and consulting for his clients. At night he writes books, raises kids, and occasionally he forms a band and “tries to make it”.\r\n\r\nMark has been writing web applications, in one form or another, since 1996. His career starting as a UI developer writing HTML and JavaScript applications before moving towards the middle(ware) with Java and Ruby.\r\n\r\nAlways wanting to share his wisdom, or more correctly just wanting to hear the sound of his own voice, Mark has spoken at several high profile conferences, include RubyConf and jQueryConf. Mark has also taught classes on Ruby and Ruby on Rails. In 2009 Mark’s first (surprisingly not his last!) book, “Distributed Programming with Ruby”, was published by Addison-Wesley. In 2012 Addison-Wesley published Mark’s second book, “Programming in CoffeeScript”.\r\n\r\nMark lives just outside of Boston with his wife Rachel and their two sons, Dylan and Leo. Mark can be found on the web at: http://www.markbates.com, http://twitter.com/markbates, and http://github.com/markbates","starts_at":"2012-04-23T11:30:00Z","ends_at":"2012-04-23T12:15:00Z","category":"standard","room":"Salon J"},{"title":"Designing Hypermedia APIs","abstract":"Rails did a lot to bring REST to developers, but its conception leaves the REST devotee feeling a bit empty. \"Where's the hypermedia?\" she says. \"REST isn't RPC,\" he may cry. \"WTF??!?!\" you may think. \"I have it right there! resources :posts ! What more is there? RPC? Huh?\"\r\n\r\nIn this talk, Steve will explain how to design your APIs so that they truly embrace the web and HTTP. Just as there's an impedance mismatch between our databases, our ORMs, and our models, there's an equal mismatch between our applications, our APIs, and our clients. Pros and cons of this approach will be discussed, as well as why we aren't building things this way yet.","name":"Steve Klabnik","bio":"Steve is a Ruby Hero, software craftsman, and an aspiring digital humanities scholar. He spends most of his time contributing to Open Source projects, and maintains both Hackety Hack and Shoes. He also teaches classes with Jumpstart Lab.","starts_at":"2012-04-23T10:30:00Z","ends_at":"2012-04-23T11:15:00Z","category":"standard","room":"Salon K"},{"title":"Deconstructing Travis","abstract":"Unless you have been living under a rock for the past year you might know of Travis CI, the continuous integration service for the open source community.\r\n\r\nTravis started as a single GitHub project which was a rails app and a resque background task. Compare that to 12 months later where Travis is now four separate deployable apps, uses two different rubies (1.9.2 and jruby), and comprises a total of 10 GitHub projects.\r\n\r\nApart from looking at how Travis works now, we will also look at how it got there, and how we broke Travis up into smaller more manageable, more concise encapsulated services.","name":"Josh Kalderimis","bio":"Josh is a top 30 Ruby on Rails contributor and has been working with the framework since 2008. He maintains a bunch of open-source Ruby projects, including multi_json, linkedin, faraday_middleware and his own completeness-fu. He's also one of Amsterdam.rb's organizers, and an integral part of the core Travis-CI team.","starts_at":"2012-04-25T14:30:00Z","ends_at":"2012-04-25T15:15:00Z","category":"standard","room":"Salon H"},{"title":"Keeping Rails Applications on Track with Brakeman","abstract":"A recent report by Veracode (http://www.veracode.com/reports/index.html) found cross-site scripting in 68% of surveyed web applications and SQL injection in 32%, even though these are well-known, easily preventable, and easily detectable vulnerabilities. As applications grow larger, it becomes harder and harder to manually verify that every line of code is adhering to security guidelines - even given the built-in protection available with Ruby on Rails.\r\n\r\nBrakeman (http://brakemanscanner.org/) is an open source static analysis tool which provides painless vulnerability scans of Rails code from \"rails new\" through deployment. Running Brakeman as a part of continuous integration provides feedback during all stages of development and can alert developers immediately when a potential vulnerability is introduced. Bringing security testing as close to the developer as possible (even scanning as files are saved) means security problems are caught faster  - and the sooner problems are found the cheaper they are to fix.\r\n\r\nAs a static analysis tool, Brakeman can be run without worrying about deploying the whole application stack: no webserver, database, configuration, or application dependencies required - not even Rails itself. This allows fast, easy vulnerability scans on any Rails project.\r\n\r\nWe talk a lot about testing in the Ruby and Rails community, but somehow security testing is passed over. This needs to change!\r\n\r\nThis talk will cover how to incorporate Brakeman into Rails development and how it can improve application security, as well as a look into how Brakeman works internally.","name":"Justin Collins","bio":"Justin is a Ph.D. candidate at UCLA  and currently works as an application security engineer at Twitter.","starts_at":"2012-04-24T13:30:00Z","ends_at":"2012-04-24T14:15:00Z","category":"standard","room":"Salon J"},{"title":"Basecamp Next: Code Spelunking","abstract":"Heard about the big Basecamp launch this March? Wondering what's new, how it's shaping Rails, and the tech behind it? We're going to go over some the practices and patterns in the new Basecamp's code base and you can learn how to improve your app with them.\r\n\r\nSome of what we'll go over:\r\n\r\n* Employing concerns to share code across models/controllers\r\n* Stacker, the CoffeeScript component behind the \"page\" based layout\r\n* Why polling for updates still works at scale\r\n* Client side testing without the hassle\r\n* Using jbuilder to keep view data out of models\r\n* Keeping your team's sanity with a single setup script\r\n* Debugging painful JavaScript performance slowdowns\r\n* How to keep your app alive even if external dependencies like Redis are down\r\n* Why tagged request logging and action/controller SQL query logging can make finding bugs easier","name":"Nick Quaranto","bio":"Programmer at 37signals, Husband, Husky wrangler, RIT Alum, http://rubygems.org Mechanic.","starts_at":"2012-04-25T11:30:00Z","ends_at":"2012-04-25T12:15:00Z","category":"standard","room":"Salon J"},{"title":"Extending Ruby with Ruby","abstract":"Other programming languages have powerful features that are often enviable while working in Ruby: Python’s function decorators, Scala’s partial evaluation, and Haskell’s lazy evaluation, among others. Fortunately, Ruby’s metaprogramming facilities give us the ability to add these features to Ruby ourselves, without the need for the core language to be changed.\r\n\r\nThis talk will walk through adding simple (yet functional) versions of the previously mentioned features to Ruby, using Ruby, and discuss the dos and don’ts of responsible Ruby metaprogramming.","name":"Michael Fairley","bio":"Michael Fairley (@michaelfairley) is the lead developer at 1000memories, where he helps people preserve and cherish their most valuable memories. He’s an active open source contributor, and maintains a handful of side projects including mincemeat.py and bestintrobook.com.","starts_at":"2012-04-25T14:30:00Z","ends_at":"2012-04-25T15:15:00Z","category":"standard","room":"Salon J"},{"title":"It’s Not in Production Unless it’s Monitored","abstract":"In the 21st century successful teams are data-driven. We’ll present a complete introduction to everything you need to start monitoring your service at every level from business drivers to per-request metrics in Rails/Rack, down to server memory/cpu. Provides a high-level overview of the fundamental components that comprise a holistic monitoring system and then drills into real-world examples with tools like ActiveSupport::Notifications, statsd/rack-statsd, and CollectD. Also covers best practices for active alerting on custom monitoring data.","name":"Joseph Ruscio","bio":"Joseph Ruscio is a Co-Founder and CTO at Librato, Inc. He’s responsible for the company’s technical strategy, architecture, and generally hacks on all levels of the product. He’s a Ruby enthusiast and the author of the aggregate and rack-test-rest gems. @josephruscio on Twitter and Github.","starts_at":"2012-04-25T10:30:00Z","ends_at":"2012-04-25T11:15:00Z","category":"standard","room":"Salon H"},{"title":"Schemaless SQL — The Best of Both Worlds","abstract":"Schemaless database are a joy to use because they make it easy to iterate on your app, especially early on. And to be honest, the relational model isn't always the best fit for real-world evolving and messy data.\r\n\r\nOn the other hand, relational databases are proven, robust, and powerful. Also, over time as your data model stabilizes, the lack of well-defined schemas becomes painful. \r\n\r\nHow are we supposed to pick one or the other? Simple: pick both. Fortunately recent advances in Postgres allow for a hybrid approach that we've been using at Heroku. The hstore datatype gives you key/value in a single column, and PLV8 enables JavaScript and JSON in Postgres. These and others in turn make Postgres the best document database in the world. \r\n\r\nWe will explore the power of hstore and PLV8, explain how to use them in your project today, and examine their role in the future of data.","name":"Will Leinweber","bio":"As a member of Heroku's incomparable Department of Data, Will runs the world's largest Postgres service. He enjoys improving experiences, pushing boundaries, and simplifying everything. @leinweber","starts_at":"2012-04-24T13:30:00Z","ends_at":"2012-04-24T14:15:00Z","category":"standard","room":"Salon K"},{"title":"Using Rails without Rails","abstract":"Rails got much more modular after 3.0 rewrite. But do you know how to use specific rails elements outside Rails? What if you would like to use ActionView with some other library (like webmachine)? Have you ever needed to render view with layouts outside of the rails stack? Or maybe you wanted to build some kind of system that fetches templates from database rather than from files? Router anyone? You know that you can use it outside rails too?\r\n\r\nIn this talk I will dive into  Rails internals and will show you what's there and how you can use it outside rails.\r\n\r\nAlthough I will focus on using those parts standalone, this knowledge will most likely help you also build your apps if you ever need something sophisticated that requires modification of regular rails behavior.","name":"Piotr Sarnacki","bio":"I'm passionate rails developer that loves open source. I was participating in Ruby Summer of Code 2010 with \"Rails 3 Mountable Apps\" project and I still try to contribute to Rails as much as I can.","starts_at":"2012-04-24T16:00:00Z","ends_at":"2012-04-24T16:45:00Z","category":"standard","room":"Salon K"},{"title":"Use the Source, Luke: High fidelity data with event sourcing","abstract":"Ever run into a really gnarly data problem and wished you had a do-over? Tired of wrestling with ActiveRecord to model a really complex domain? Looking for a good way to echo state changes to external systems?  Then grab a cup of joe and settle in for a look at event-sourcing your data.\r\n\r\nEvent-sourced data uses Plain Old Ruby Objects (POROs) to model your data and exclusively uses events to mutate state on those objects. By serializing the events, the state of your data can be recreated for any point in time, and outside listeners can create specialized purposeful datastores of the data, enabling complex business requirements with fewer hassles.  We'll also touch on other architectural patterns like DCI and CQRS that play well with this idea.","name":"Keith Gaddis","bio":"Keith Gaddis is a developer with almost fifteen years experience developing complex web applications, in industries ranging from medical applications to publishing to sports media.  He has over six years experience with Ruby and Rails, and has been building complex web applications for more than a decade.","starts_at":"2012-04-23T14:30:00Z","ends_at":"2012-04-23T15:15:00Z","category":"standard","room":"Salon K"},{"title":"Zero downtime deploys for Rails apps","abstract":"What does it take to deploy an application without any downtime?\r\n\r\nMore than most Ruby developers would expect, turns out; what is aggravated by the lack of documentation and other resources on this topic.\r\n\r\nIn this talk we'll dive into both development practices (hot compatibility, database migrations, caching) and deployment setup (Heroku, Unicorn, HAProxy), covering everything you need to know in order to ship code without affecting a single customer.","name":"Pedro Belo","bio":"Hailing from Brazil, Pedro moved to the US and A and joined Heroku back in 2008, taking projects ranging from Node.js support to organizing Starcraft nights. Today he works on the API team, focused on making the Heroku public APIs smoother.","starts_at":"2012-04-24T16:00:00Z","ends_at":"2012-04-24T16:45:00Z","category":"standard","room":"Salon J"},{"title":"Evented Ruby vs Node.js","abstract":"While Node.js is the hot new kid on the block, evented libraries like EventMachine for Ruby and Twisted for Python have existed for a long time. When does it make sense to use one over the other? What are the advantages and disadvantages to using node over ruby? In this talk, you will learn how to get the same power of concurrency enjoyed by Node.js while continuing to write in the language you know and love. Topics covered will include pubsub with redis or faye, building evented rack applications, and running evented applications alongside existing Rails apps.","name":"Jerry Cheung","bio":"Jerry Cheung splits his time as a co-founder of Opperator and a developer at Intridea. He is a co-author of the upcoming MacRuby in Action, and likes contributing to open source. He's currently dabbling in evented Ruby and Grape driven webapps. When he's not coding, he stalks awesome cars in Southern California and writes about them in RockyRoadBlog.","starts_at":"2012-04-24T14:30:00Z","ends_at":"2012-04-24T15:15:00Z","category":"standard","room":"Salon K"},{"title":"Digging Deep with ActiveSupport::Notifications","abstract":"Rails 3 and above includes a powerful instrumentation system, ActiveSupport::Notifications, which can be used to track performance and event information for all aspects of your application. Notifications are light-weight, easy to setup, and can be consumed by multiple subscribers (logs, audit trails, consolidated metrics, other parts of your application).\r\n\r\nIn this session we’ll start with the basics of ActiveSupport::Notifications and work our way to powerful advanced use cases. Topics we’ll explore include:\r\n\r\n - How to set up and use notifications\r\n - Logging what you want from any tier of your system\r\n - How to capture and aggregate performance/business data for the metrics you care about most\r\n - Conditional monitoring in production: flag on and off data by system or customer to get to the root of problems more quickly\r\n - Using ActiveSupport::Notifications in non-Rails applications and your own libraries","name":"Matt Sanders","bio":"Matt Sanders (@nextmat) is a Senior Software Engineer at Librato, Inc, where he works on the Metrics real-time monitoring platform and dreams of making your data beautiful. He’s been active in the Ruby community since 2005 and is a regular contributor to open-source projects including compass-960 and excon. On sunny days he can be found chasing waves on the Texas coast.","starts_at":"2012-04-24T14:30:00Z","ends_at":"2012-04-24T15:15:00Z","category":"standard","room":"Salon H"},{"title":"Sand Piles and Software","abstract":"This talk applies the concepts of chaos theory to software development using the Bak–Tang–Wiesenfeld sand pile model as the vehicle for exploration. The sand pile model, which is used to show how a complex system is attracted to living on the edge of chaos, will be used as a both a powerful metaphor and analogy for building software. Software, it turns out, has its own natural attraction to living in its own edge of chaos. In this talk, we'll explore what this means and entertain questions for what to do about it.\r\n\r\nThe speaker's hypothesis is that by understanding how complex systems work we can gain insights to better understand and improve the act of building software. By looking through the lens of the sand pile model we'll explore the following:\r\n\r\n* what the sand pile model can tell us about software development\r\n* how software is naturally attracted to its own chaos\r\n* the impacts on software living perpetually on the edge of chaos\r\n* how existing software practices can be used to detract software away from chaos\r\n* what this means not only for our software, but for our teams, and ourselves individually\r\n\r\nThis thought-provoking perspective will leave you with new ways to think about software. You’ll walk away having learned a little about chaos, complexity, and how they apply to software with a thought-provoking perspective and inspiration for thinking about software in new ways.","name":"Zach Dennis","bio":"Zach Dennis is a Software Craftsman/Partner at Mutually Human Software in Grand Rapids, MI. He's a proven RSpec and Ruby guru, founder of the Michigan Ruby User Group and co-author of The RSpec Book. He's contributed to several projects such as Ruby's standard library documentation, Ruby on Rails, and RSpec as well as many of his own. He's been leading and mentoring teams for almost an entire decade. In his spare time he reads copiously and plays the guitar. You can find him as @zachdennis on Twitter and @zdennis on Github.","starts_at":"2012-04-24T11:30:00Z","ends_at":"2012-04-24T12:15:00Z","category":"standard","room":"Salon J"},{"title":"i18n on Rails: A Twitter Approach","abstract":"Twitter's internationalization (i18n) and localization (l10n) model doesn't follow traditional methods.  Instead of contracting out to professional translators, Twitter maintains an active community of over 500,000 volunteers who have helped successfully launch Twitter in 28 languages, including right-to-left languages like Hebrew and Arabic.  Learn about some of the technical challenges we face, how to translate a Rails application at scale, and what to do when the i18n gem and po files aren't quite enough.  We'll take a look at the tricky stuff too, like dates, times, lists, plurals, alphabetization, and capitalization using the twitter_cldr gem, and go over internationalization best practices.  Finally, we'll explain how to maintain internationalization of your Javascript alongside your Rails code for an end-to-end solution.","name":"Cameron Dutro","bio":"Cameron Dutro has worked for Twitter's International Team for about a year and a half, helping build and maintain the Translation Center, Twitter's crowdsourced translation platform.  Although he only started using Ruby and Rails a few years ago, he's a big fan of their extendibility and elegance.  Cameron is also the author of the twitter_cldr gem, an attempt to bring JDK-level internationalization capabilities to the Ruby community.","starts_at":"2012-04-23T10:30:00Z","ends_at":"2012-04-23T11:15:00Z","category":"standard","room":"Salon H"},{"title":"Sustainable Productivity with Rails","abstract":"Ruby on Rails claims to be \"optimized for programmer happiness and sustainable productivity.\" I strongly disagree with the latter assertion. In this talk I will channel my half decade of industry Rails experience into expounding this position and providing constructive feedback as to what needs to change---in both the framework and the community---before we can support this claim. I'll also cover practical techniques you can use to be sustainably productive on your own projects in the meantime.","name":"Xavier Shay","bio":"Xavier Shay recently emigrated from Australia to San Francisco to work on the engineering team at Square. Prior, he worked on large Ruby on Rails projects at The Conversation, NZX, Redbubble, and mentored many more. In 2010 he presented a world tour of a training course titled \"Your Database Is Your Friend\". He has been working with Ruby on Rails for half a decade, and has published and contributed to over 80 open source projects according to GitHub.","starts_at":"2012-04-24T14:30:00Z","ends_at":"2012-04-24T15:15:00Z","category":"standard","room":"Salon J"},{"title":"Chanko - How Cookpad safely releases multiple feature prototypes - in production - for test segments of their 15 million engaged users","abstract":"Chanko provides a simple framework for rapidly and safely prototyping new features in your production Rails app, and exposing these prototypes to specified segments of your user base.\r\n\r\nWith Chanko, you can release many concurrent features and independently manage which users see them. If there are errors with any chanko, it will be automatially removed, without impacting your site.\r\n\r\nChanko was extracted from Cookpad.com where the team uses it daily to test new features live, in production, on the largest Rails site in Japan which serves 500 million page views a month to a user based of over 15 million highly engaged uses.\r\n","name":"Kenta Murata","bio":"Kenta Murata is an Engineer at Cookpad in Tokyo, Japan. He is also a Ruby committer maintaining the bigdecimal library.","starts_at":"2012-04-25T11:30:00Z","ends_at":"2012-04-25T12:15:00Z","category":"standard","room":"Salon H"},{"title":"Let's make the web faster - tips from trenches @ Google","abstract":"Google loves speed, and we want to make the entire web faster - yes, that includes your Rails app! We'll explore what we've learned from running our own services at scale, as well as cover the research, projects, and open sourced tools we've developed in the process. \r\n\r\nWe'll start at the top with website optimization best practices, take a look at what the browser and HTML5 can do for us, take a detour into the optimizations for the mobile web, and finally dive deep into the SPDY and TCP protocol optimizations. \r\n\r\nWe'll cover a lot of ground, so bring a coffee. By the end of the session, you should have a good checklist to help you optimize your own site.","name":"Ilya Grigorik","bio":"Ilya Grigorik is a web performance engineer, an open-source and Ruby evangelist, a data geek, and a proverbial early adopter of all things digital. He is currently helping lead the social analytics and web performance efforts at Google. Earlier, Ilya was the founder and CTO of PostRank, a social analytics company, which was acquired by Google.","starts_at":"2012-04-24T11:30:00Z","ends_at":"2012-04-24T12:15:00Z","category":"standard","room":"Salon H"},{"title":"MiniTest: Refactoring Test Unit and RSpec back to version 0.0.1","abstract":"MiniTest is the no-nonsense testing framework you already know how to use. If we strive for cleaner and simpler code in our own work, wouldn't it be nice to have that in our test framework too? Whether you're a Test Unit fan or RSpec fan, you'll feel right at home using MiniTest. Its simplicity makes it fast, easy to use, extendable, and maybe most importantly, easy to understand. Plus, Rails 4 uses MiniTest.","name":"Jared Ning","bio":"Jared Ning is a freelancer from Oklahoma City. Since becoming a freelancer a year and half ago, he has been living according to the philosophy \"red, green, travel until the money runs out, repeat\".","starts_at":"2012-04-25T13:30:00Z","ends_at":"2012-04-25T14:15:00Z","category":"standard","room":"Salon J"},{"title":"Using Backbone.js with Rails: Patterns from the Wild","abstract":"Backbone.js is a flexible, lightweight tool for structuring the JavaScript in a modern web application. It goes great with Rails! But beware - \"flexible and lightweight\" are code words for \"you build your own plumbing.\" Backbone is new enough that we haven't established strong patterns for that plumbing yet, so different Backbone codebases look very different, and when you're new to the idea of structuring your JavaScript, it can be tough to tell where the win is. \r\n\r\nSo in this talk I'll demystify Backbone. I'll show several very different ways I've used it on real Rails apps. You'll get a feel for the circumstances when Backbone makes sense, and moreover, when each of the different approaches to Backbone make sense. ","name":"Sarah Mei","bio":"Sarah Mei is a Ruby and JavaScript developer from San Francisco. She has been programming since the days when Java was the new hotness, and for the last two years she's been at Pivotal Labs. She's on the core team for Diaspora and Pie, and contributes code to many other open source projects. She also co-founded RailsBridge, a non-profit that has taught more than 600 people how to program in the last three years.","starts_at":"2012-04-23T10:30:00Z","ends_at":"2012-04-23T11:15:00Z","category":"standard","room":"Salon J"},{"title":"Using XMPP as an Asynchronous Communication Layer Between Ruby and JavaScript","abstract":"Although XMPP is most often used as a chat protocol, it can also provide a robust asynchronous communication channel in other application scenarios. In this presentation, we will provide introduction to Strophe.js, XMPP4R, and ejabberd, which are the XMPP components that we use to integrate our device automation framework and living room devices under test. By using these off-the-shelf components, we addressed our needs for getting around internal firewalls, application security (based on SASL), and asynchronous command-response handling.\r\n","name":"Andrew Carter and Steve Jang","bio":"Andrew Carter is a software engineer with 18 years of professional experience. He spent ten years at Microsoft on SQL Server, bCentral, and Xbox Live teams. Andrew has worked for several Seattle area software companies including Source Labs, Pure Networks, Jobster, and Getty Images. Currently, he is a Principal Software Developer at Hulu in the Seattle office.\r\n\r\nSteve Jang is a software engineer with experience building embedded systems, communication protocols, web services, and Rails and database applications over the last 18 years. After working at Geoworks, Microsoft, and a string of start up companies in Seattle area, he joined Hulu about 6 months ago, and is currently working on device automation framework for Hulu TV devices.\r\n","starts_at":"2012-04-24T16:00:00Z","ends_at":"2012-04-24T16:45:00Z","category":"products","room":"Room 615"},{"title":"Up and to the right – how Spiceworks is scaling 200 million requests per month","abstract":"Curious how Spiceworks, a social business app built on Rails, keeps 2 million active users happy? With Ruby on Rails, baby! In the last year our usage has increased 8x and now exceeds 200 million requests per month. Join Francis Sullivan, CTO and Co-founder, and David Babbitt, Technical Program Manager, to hear about the architecture and best practices we adopted to make this happen.\r\n \r\nGet the ins-and-outs on: \r\n·  Hosting a high volume Rails application\r\n·  Choosing what to optimize\r\n·  Lessons learned while moving to JRuby\r\n·  Updating a large codebase through Rails beta to Rails 3\r\n·  Scaling the dev organization \r\n","name":"Francis Sullivan and David Babbitt","bio":"Coming soon","starts_at":"2012-04-23T13:30:00Z","ends_at":"2012-04-23T14:15:00Z","category":"products","room":"Room 615"},{"title":"Preparing for Rapid Growth - Tips for Enabling Your Rails App and Team to Grow Quickly","abstract":"Every young company expects to grow quickly, but is your engineering team really ready for it?  In 3 years, iTriage went from a kitchen table to one of the leading mobile consumer healthcare apps with over 5 million downloads. Staying ahead of this growth didn't just mean hiring more Rails engineers. \r\n\r\nPatrick will discuss what iTriage did (and continues to do) to stay ahead of our growth, including: \r\n- Technical architecture, including use of Rails Engines to enable a modular, RESTful service-based design\r\n- Enabling high quality iPhone, Android and Web apps\r\n- Development and release management processes\r\n- Recruiting and hiring approaches \r\n","name":"Patrick Leonard","bio":"Patrick is responsible for iTriage’s overall technology vision and strategy, product software engineering, and system operations. To this role, Patrick brings a broad range of software and technology leadership in software applications and infrastructure. His experience includes software design and development, architecture, product management, international markets, public policy, professional services and product marketing. He is a recognized expert in the areas of web & mobile application development, parallel programming, and SOA, and has written and spoken in publications and events for Sun, Intel, Microsoft and IEEE/ACM Supercomputing among others.\r\n\r\nPatrick also co-invented a patented implementation of content-based message routing. Before joining iTriage, he headed the software engineering division at Axion Health, and before that Rogue Wave Software. Prior to that, Patrick created the Web and E-business product line for J.D. Edwards (now part of Oracle) and designed and built custom enterprise systems for Accenture (formerly Andersen Consulting).\r\n\r\nHe serves on the advisory board for the University of Denver’s College of Engineering and Computer Science and is co-chair of the Public Policy Committee for Colorado Software and Internet Association (CSIA).\r\n","starts_at":"2012-04-24T10:30:00Z","ends_at":"2012-04-24T11:15:00Z","category":"products","room":"Room 615"},{"title":"Patella: It's Memoization into Memcached calculated in the background with Resque.","abstract":"I regularly write code that does something great but is slow as a dog. Denormalizing / pre-computing / backgrounding are all fine, but they're all an investment and they leave tentacles all through the code. I want to be able to try out slow but very useful code in my app without the friction of performance concerns, but also without worrying that my ops engineer is going to kill me in my sleep.\r\n\r\nWouldn't it be nice to add one line to our models that takes care of caching, cache keys, backgrounding, dog-piling, and cache warming? Oh, and it should give the UI clear consistent hooks so that it's clear whether the data is ready so the UI can render a spinner or disable a feature until the computation is complete.\r\n\r\nWe'll take a look at a series of techniques that we use at PatientsLikeMe to allow us to safely and quickly put some very expensive queries on the website so that we can evaluate whether it's worthwhile to create longer term solutions. The solution we've come up with is a lot of gloss over memcache and resque that makes it feel like we can memoize any method in our application and lets us focus on the goals of the algorithms rather than their performance and architecture.\r\n\r\nThis talk will feature: memcache, resque, a bit of metaprogramming, a look at caching in the wild and code that fixes some usual problems, and a fairly epic SQL query with some nice Postgres features you should know about.\r\n\r\nYou should come if: you want to take a look at some practical solutions that we use in production to be able to roll out computationally expensive features.","name":"Jeff Dwyer","bio":"Jeff Dwyer is a Sr Software Engineer at PatientsLikeMe. He's the author of the book Pro Web 2.0 with GWT and he will buy you a drink if you tell him you've read it. Even if you're lying. Once upon a time he taught GWT at conferences from Las Vegas to Prague. If you delayed your flight from Java to Ruby because you were enthralled by one of these talks he will buy you two drinks. Jeff is a father of two and lives in Hanover, NH.","starts_at":"2012-04-24T10:30:00Z","ends_at":"2012-04-24T11:15:00Z","category":"standard","room":"Salon J"},{"title":"Lightning Talks","abstract":"You know 'em, you love 'em -- five-minute talks by attendees on topics that they're passionate about. We'll have a signup sheet available from the start of the conference, so start thinking of ideas today!","name":"Dr Nic Williams","bio":"Dr Nic is a developer’s developer.\r\n\r\nHe writes blog posts for developers; creates tools, libraries and text editor extensions for developers; and speaks to developers at conferences.\r\n\r\nHe’s the VP of Developer Evangelism at Engine Yard, the premier platform as a service.\r\n\r\nHe’s Australian and now living in the Bay Area.\r\n\r\nAnd he’s funny; if you can understand his accent.","starts_at":"2012-04-25T13:30:00Z","ends_at":"2012-04-25T15:30:00Z","category":"standard","room":"Salon K"},{"title":"","abstract":"","name":"Ignite RailsConf","bio":"Five minutes, 20 slides. What would you say? Sixteen artists, technologists, thinkers, and personalities take the stage to answer this challenge. What is Ignite? Fast-paced, fun, thought-provoking, social, local, global - Ignite is all of these and more. It's a high-energy evening of 5-minute talks by people who have an idea - and the guts to get onstage and share it with the rest of the Rails community.","starts_at":"2012-04-22T18:00:00Z","ends_at":"2012-04-22T21:00:00Z","category":"external","room":"Salon J"},{"title":"","abstract":"","name":"KidsRuby","bio":"Did you ever want to make a videogame, program a robot, or create a web site? Now you can! \r\n\r\nCome to KidsCodeCamp, a free one-day event to learn how to use computers and technology to make things that do whatever you want.\r\n","starts_at":"2012-04-22T10:30:00Z","ends_at":"2012-04-22T16:30:00Z","category":"external","room":"Room 616"},{"title":"Morning Break","abstract":"","name":"Morning Break","bio":"Morning Break","starts_at":"2012-04-23T10:00:00Z","ends_at":"2012-04-23T10:30:00Z","category":"break","room":""},{"title":"Morning Break","abstract":"","name":"Morning Break","bio":"Morning Break","starts_at":"2012-04-24T10:00:00Z","ends_at":"2012-04-24T10:30:00Z","category":"break","room":""},{"title":"Morning Break","abstract":"","name":"Morning Break","bio":"Morning Break","starts_at":"2012-04-25T10:00:00Z","ends_at":"2012-04-25T10:30:00Z","category":"break","room":""},{"title":"Afternoon Break","abstract":"","name":"Afternoon Break","bio":"Afternoon Break","starts_at":"2012-04-23T15:30:00Z","ends_at":"2012-04-23T16:00:00Z","category":"break","room":""},{"title":"Afternoon Break","abstract":"","name":"Afternoon Break","bio":"Afternoon Break","starts_at":"2012-04-24T15:30:00Z","ends_at":"2012-04-24T16:00:00Z","category":"break","room":""},{"title":"Lunch","abstract":"","name":"Lunch","bio":"Lunch","starts_at":"2012-04-24T12:30:00Z","ends_at":"2012-04-24T13:30:00Z","category":"break","room":""},{"title":"Lunch","abstract":"","name":"Lunch","bio":"Lunch","starts_at":"2012-04-25T12:30:00Z","ends_at":"2012-04-25T13:30:00Z","category":"break","room":""},{"title":"Lunch","abstract":"","name":"Lunch","bio":"Lunch","starts_at":"2012-04-23T12:30:00Z","ends_at":"2012-04-23T13:30:00Z","category":"break","room":""},{"title":"Dinner","abstract":"","name":"Dinner","bio":"Dinner","starts_at":"2012-04-24T17:00:00Z","ends_at":"2012-04-24T19:00:00Z","category":"break","room":""},{"title":"Dinner","abstract":"","name":"Dinner","bio":"Dinner","starts_at":"2012-04-23T18:30:00Z","ends_at":"2012-04-23T20:00:00Z","category":"break","room":""},{"title":"Exhibit Hall","abstract":"","name":"Exhibit Hall","bio":"Exhibit Hall","starts_at":"2012-04-23T10:00:00Z","ends_at":"2012-04-23T17:00:00Z","category":"exhibit hall","room":"Exhibit Hall"},{"title":"Exhibit Hall","abstract":"","name":"Exhibit Hall","bio":"Exhibit Hall","starts_at":"2012-04-24T10:00:00Z","ends_at":"2012-04-24T17:00:00Z","category":"exhibit hall","room":"Exhibit Hall"},{"title":"BohConf","abstract":"","name":"BohConf","bio":"BohConf","starts_at":"2012-04-23T09:00:00Z","ends_at":"2012-04-23T21:00:00Z","category":"bohconf","room":"Room 406/408"},{"title":"BohConf","abstract":"","name":"BohConf","bio":"BohConf","starts_at":"2012-04-24T09:00:00Z","ends_at":"2012-04-24T21:00:00Z","category":"bohconf","room":"Room 406/408"},{"title":"BohConf","abstract":"","name":"BohConf","bio":"BohConf","starts_at":"2012-04-25T09:00:00Z","ends_at":"2012-04-25T16:00:00Z","category":"bohconf","room":"Room 406/408"},{"title":"A Polyglot Heroku","abstract":"Over the past year, Heroku has expanded by going polyglot and supporting languages like Java, Clojure, Python, Node.js, and Scala in addition to Ruby. In this session, we will discuss major updates to the platform and our emphasis on making the Ruby developer experience even better. We'll leave plenty of time at the end for any questions.","name":"Terence Lee","bio":"Terence works at Heroku, maintaining the Ruby stack and some OSS projects such as Bundler and Resque. When he’s not going to an awesome Heroku or Ruby event, he lives in Austin, TX, the taco capital of America.\r\n","starts_at":"2012-04-23T16:00:00Z","ends_at":"2012-04-23T16:45:00Z","category":"products","room":"Room 615"},{"title":"COOKPAD","abstract":"TBD","name":"COOKPAD","bio":"Thank you to the Rails community, from Cookpad and 15 million families.","starts_at":"2012-04-25T09:50:00Z","ends_at":"2012-04-25T10:00:00Z","category":"keynote","room":"Salon HJK"},{"title":"Not a Vendor Pitch: Real World Rails Apps at Massive Scale:: A Panel Discussion with New Relic, Groupon, Zendesk, Fanzter, and Uken","abstract":"New Relic CEO Lewis Cirne will lead a panel discussion with representatives from some of today's most popular, highly-trafficked web sites. With millions of uniques a month, find out how these organizations are optimizing their Rails-based sites for mobile, for unexpected traffic bursts, and for seasonality.","name":"Lew Cirne, Pitr Vernigorov, Joshua Warchol, Tim Sturge, Jon Pliske","bio":"Lew Cirne, CEO of New Relic\r\nPitr Vernigorov, Senior Architect at Uken (gaming)\r\nJoshua Warchol, VP of Technology at Fanzter (ecommerce)\r\nTim Sturge, Director of Operations at Zendesk (collab/support)\r\nJon Pliske, from Groupon (ecommerce)","starts_at":"2012-04-23T10:30:00Z","ends_at":"2012-04-23T11:15:00Z","category":"products","room":"Room 615"},{"title":"Engine Yard - The Cloud, Application Support, and You - Ask Me Anything","abstract":"This panel is made up of EY Support Engineers and Developers and they are ready to answer your questions!  Want to know more about deploying to the cloud?  What does PaaS mean to you?  What is the EY Stack?\r\n","name":"Engine Yard","bio":"Sponsored by Engine Yard","starts_at":"2012-04-23T11:30:00Z","ends_at":"2012-04-23T12:15:00Z","category":"products","room":"Room 615"},{"title":"The Future of Sass","abstract":"A glimpse of some of the features coming to Sass in the pending 3.2 release. Plus, a huge announcement about the project that's been months in the making as we have secretly toiled away on something that we think will be awesome. Hear it first at this talk. Repositories will be made public when the talk is over. Shh! Its a secret!","name":"Hampton Catlin","bio":"Hampton Catlin is the inventor of Sass, a CSS generating language, and the Haml markup language.\r\nHe is currently the Director of Engineering at Moovweb, a (bootstrapped!) startup focusing on transforming how we interact with the web. He is the original creator of Wikipedia Mobile (m.wikipedia.org) and is also the creator of several successful iPhone applications that have been downloaded by over 3 million people.","starts_at":"2012-04-23T16:00:00Z","ends_at":"2012-04-23T16:45:00Z","category":"standard","room":"Salon H"}]